def area(a, b): 
      '''Находит произведение двух поданных на вход чисел
    
            Параметры:
                a (int) - первая сторона прямоугольника
                b (int) - вторая сторона прямоугольника

            Возвращаемое значение:
                a * b: Найденная площадь прямоугольника со сторонами a и b
    
    ''' 
    return a * b 

def perimeter(a, b): 
     '''Находит сумму двух поданных на вход чисел умноженных на 2
    
            Параметры:
                a (int) - первая сторона прямоугольника
                b (int) - вторая сторона прямоугольника

            Возвращаемое значение:
                2*(a + b): Найденная площадь прямоугольника со сторонами a и b
    '''
    return (a + b)*2 