
def area(a):
    '''Находит произведение числа поданного на вход на само себя
    
            Параметры:
                a (int) - сторона квадрата
                
            Возвращаемое значение:
                a * a: Найденная площадь квадрата
    
    ''' 
    return a * a


def perimeter(a):
    '''Находит произведение числа поданного на вход на 4
    
            Параметры:
                a (int) - сторона квадрата
                
            Возвращаемое значение:
                4 * a: Найденный периметр квадрата
    
    ''' 
    return 4 * a
