def area(a, h): 
    '''Находит произведение двух поданных на вход чисел поделённых на 2
    
            Параметры:
                a (int) - сторона треугольника
                h (int) - высота треугольника

            Возвращаемое значение:
                a * h / 2 : Найденная площадь треугольника с стороной a и высотой h
    '''
    return a * h / 2 

def perimeter(a, b, c): 
     '''Находит сумму трёх данных на вход значений a b c
    
            Параметры:
                a (int) - первая сторона треугольника
                b (int) - вторая сторона треугольника
                c (int) - третья сторона треугольника

            Возвращаемое значение:
                a + b + c  : Найденный периметр треугольника
    '''
    return a + b + c 
